{
  "story_title": "My (32 Female) husband (36 Male) became a robot and I don’t know how to help him.",
  "post_author": "u/throwRA-193837472772",
  "story_text": "We’ve been married for 6 years and have 2 kids I’m pregnant with a third. My husband works from 9-5, comes home, does his chores, plays with our 2 kids, talks to me for a little bit, and then goes to sleep. But he doesn’t seem to enjoy doing any of it. Like this whole thing is one big chore. He used to be this goofy guy who smiled and told jokes all the time, but I haven’t seen the man smile in months. It’s not like he’s neglecting his duties as a husband and father, but he acts like it’s just that, duties. Like hanging with the kids and me is a second job. I’m grateful for all he’s doing, and he makes all of our lives sooo much easier, but it’s like he’s constantly on the clock and I think he might be depressed. I tried asking him if he was doing ok and he tells me he’s doing “fantastic”, but I know he’s not. That’s the line he uses at work when customers try to make small talk and ask how he’s doing. He doesn’t take anytime for himself. He doesn’t take any breaks, he stopped playing games and stopped watching tv. He just does what I feel he thinks needs to be done and I don’t know how to help him out. Our sex life has become one sided. We do it frequently but only because I initiate frequently. Even if he doesn’t seem in the mood he’ll do it. Like it’s his responsibility to “make me happy.” It feels like he isn’t there in the moment, like his mind is wandering the whole time we’re intimate and that, to me, feels worse than getting rejected. I don’t know what’s going on, and I don’t know how to help because he won’t let me in. To anybody else he seems fine, but I know something is wrong and I don’t know how to fix this. I miss my husband, the guy who complained, and told jokes. Not this robotic shell that looks like him. Edit: Alright, wow! I didn’t expect this to blow up. I want to thank you all for your advice; I really appreciate it. It’s clear to me now that my husband is overworked and “burnt out.” He comes home from work in a couple hours and I’m going to sit him down and talk to him. I’m going to tell him how I feel, and I hope that together we can find a solution that turns him back into the man he once was. Hey everybody, here’s the update. I wrote this a couple days ago but couldn’t post it because it was too soon. My husband came home at around 6 o’clock, and after he had something to eat I took him to the bedroom to talk. I sat him down on the bed and told him I was worried about him. I didn’t know exactly how to phrase my worries so I just showed him my original post. When he finished reading the post he starting crying, like full on crying. In all the years that I have known this man, I had never seen a tear roll down his eye. I held him for a few minutes until he could recompose himself, and he told me everything. He told me that the world was in a “shitty place” right now, and that we’re bringing a child into a stressful time. He said when I became pregnant he felt he had to step up. He needed to take care of things because it was his responsibility. He said that the weight of carrying the family was so much harder than he anticipated so he thought if he “doubled down” he could get through it. But the more he tried the “darker the tunnel got” and eventually he couldn’t see an end. He said that he feels like he’s “constantly drowning, and the only breath of fresh air is on the car ride between home and work.” He said that sometimes the stress is so much that he throws up, but doesn’t tell anyone and instead keeps going with his day. He then pulled out a pack of gum from his pocket and said “this was for when it happens.” I asked him why he couldn’t tell me any of this, and he said he didn’t want to “burden me with the truth.” He said that, he thought if he told me everything, that I would stop seeing him as a “protecter and provider”, and that I would inevitably stop loving him. Hearing him say that brought tears to my eyes because I didn’t know where he got the notion I would feel that way. I asked him if he wanted to quit his job but surprisingly he said the job doesn’t bother him. He said the work in of it self was fine. It’s just now he feels an added weight to provide because not only was he fortunate enough to keep his job in the pandemic, but we also had a kid on the way. He said that some days he feels like packing a suit case and running to some tropical island for a week and not telling anyone. But then he feels guilty and doubles down even more. I told him that maybe he should go on a trip. I said that he deserved a break, and maybe if he did exactly that he’d feel better. He tried to protest, but I insisted. In the end said that he’ll only go, if we go together. Like a romantic get away between spouses. Once things start to clear up and before the baby is due, he wants to take a week off from work, drop the kids off at Grandma’s house and have us go on a vacation. Just the two of us, like we used to when we first got married. He also said he wants to take the day off tomorrow and just sleep in, so that’s the plan. I’ll call his boss tomorrow and say that he’s sick and can’t come in, it’s not like they’ll make a sick man come in to work. There’s a pandemic going on :). Right now he’s playing with the kids and it doesn’t feel like he’s doing one of his chores. He actually seems to be enjoying himself. For the first time in months I don’t see the robot, I see my husband. Edit: Hey everyone, I want to thank you all for the support. I read all of your comments, and I appreciate all of you. I didn’t expect this to get so much traction, so I want to clarify some things. First things first, my husband says hi. I wanted to clarify about the chores people are taking about. I want to say that I know as a Stay at home mom the bulk of chores goes to me. I cook and clean and do laundry because I know it’s my responsibility. My husband’s only chores are doing dishes, vacuuming every three days, and a few other “house maintenance” stuff. I did in fact call in sick for my husband, but I made sure that I said he had a migraine. I saw on google that it wasn’t a symptom of COVID if it was an isolated symptom. His boss was okay with it and said he can come back whenever he feels better. The pregnancy wasn’t an accident. We both did want to have 3 kids because we were both raised in 3 kid families. We actively tried for the first 2, but for baby number 3 it was kind of a “if it happens it happens” kind of thing. We’re both happy with the amount of kids we have/ will have and are hopefully done. We are not considering abortion nor adoption. We realize that a one week vacation isn’t enough to get rid of his stress and are both trying to come up with a solution that alleviates his stress in a more sustainable way. Right now we’re thinking about setting up an hour or 2 a day that’s, “daddy’s time.” No kids, no me, no work. Just for him to relax. To those of you who think this fake; there isn’t any way I can change your minds about this situation so I’m not really too bothered. I just hope you this never happens to you guys."
}